04_tests/reports/performance/raw/hpa-k6-2026-08-28.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-hpa-product-burn.js
        output: -

     scenarios: (100.00%) 1 scenario, 12 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 12 looping VUs for 1m45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/12 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 01/12 VUs  0m01.0s/1m45.0s

running (0m02.0s), 01/12 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 01/12 VUs  0m02.0s/1m45.0s

running (0m03.0s), 01/12 VUs, 19 complete and 0 interrupted iterations
default   [   3% ] 01/12 VUs  0m03.0s/1m45.0s

running (0m04.0s), 01/12 VUs, 26 complete and 0 interrupted iterations
default   [   4% ] 01/12 VUs  0m04.0s/1m45.0s

running (0m05.0s), 01/12 VUs, 33 complete and 0 interrupted iterations
default   [   5% ] 01/12 VUs  0m05.0s/1m45.0s

running (0m06.0s), 02/12 VUs, 40 complete and 0 interrupted iterations
default   [   6% ] 02/12 VUs  0m06.0s/1m45.0s

running (0m07.0s), 02/12 VUs, 48 complete and 0 interrupted iterations
default   [   7% ] 02/12 VUs  0m07.0s/1m45.0s

running (0m08.0s), 02/12 VUs, 56 complete and 0 interrupted iterations
default   [   8% ] 02/12 VUs  0m08.0s/1m45.0s

running (0m09.0s), 02/12 VUs, 64 complete and 0 interrupted iterations
default   [   9% ] 02/12 VUs  0m09.0s/1m45.0s

running (0m10.0s), 02/12 VUs, 72 complete and 0 interrupted iterations
default   [  10% ] 02/12 VUs  0m10.0s/1m45.0s

running (0m11.0s), 03/12 VUs, 82 complete and 0 interrupted iterations
default   [  10% ] 03/12 VUs  0m11.0s/1m45.0s

running (0m12.0s), 03/12 VUs, 91 complete and 0 interrupted iterations
default   [  11% ] 03/12 VUs  0m12.0s/1m45.0s

running (0m13.0s), 03/12 VUs, 97 complete and 0 interrupted iterations
default   [  12% ] 03/12 VUs  0m13.0s/1m45.0s

running (0m14.0s), 03/12 VUs, 106 complete and 0 interrupted iterations
default   [  13% ] 03/12 VUs  0m14.0s/1m45.0s

running (0m15.0s), 03/12 VUs, 115 complete and 0 interrupted iterations
default   [  14% ] 03/12 VUs  0m15.0s/1m45.0s

running (0m16.0s), 04/12 VUs, 126 complete and 0 interrupted iterations
default   [  15% ] 04/12 VUs  0m16.0s/1m45.0s

running (0m17.0s), 04/12 VUs, 134 complete and 0 interrupted iterations
default   [  16% ] 04/12 VUs  0m17.0s/1m45.0s

running (0m18.0s), 04/12 VUs, 142 complete and 0 interrupted iterations
default   [  17% ] 04/12 VUs  0m18.0s/1m45.0s

running (0m19.0s), 04/12 VUs, 150 complete and 0 interrupted iterations
default   [  18% ] 04/12 VUs  0m19.0s/1m45.0s

running (0m20.0s), 04/12 VUs, 162 complete and 0 interrupted iterations
default   [  19% ] 04/12 VUs  0m20.0s/1m45.0s

running (0m21.0s), 04/12 VUs, 170 complete and 0 interrupted iterations
default   [  20% ] 04/12 VUs  0m21.0s/1m45.0s

running (0m22.0s), 04/12 VUs, 178 complete and 0 interrupted iterations
default   [  21% ] 04/12 VUs  0m22.0s/1m45.0s

running (0m23.0s), 04/12 VUs, 186 complete and 0 interrupted iterations
default   [  22% ] 04/12 VUs  0m23.0s/1m45.0s

running (0m24.0s), 04/12 VUs, 194 complete and 0 interrupted iterations
default   [  23% ] 04/12 VUs  0m24.0s/1m45.0s

running (0m25.0s), 05/12 VUs, 207 complete and 0 interrupted iterations
default   [  24% ] 05/12 VUs  0m25.0s/1m45.0s

running (0m26.0s), 05/12 VUs, 212 complete and 0 interrupted iterations
default   [  25% ] 05/12 VUs  0m26.0s/1m45.0s

running (0m27.0s), 05/12 VUs, 222 complete and 0 interrupted iterations
default   [  26% ] 05/12 VUs  0m27.0s/1m45.0s

running (0m28.0s), 05/12 VUs, 232 complete and 0 interrupted iterations
default   [  27% ] 05/12 VUs  0m28.0s/1m45.0s

running (0m29.0s), 05/12 VUs, 242 complete and 0 interrupted iterations
default   [  28% ] 05/12 VUs  0m29.0s/1m45.0s

running (0m30.0s), 05/12 VUs, 252 complete and 0 interrupted iterations
default   [  29% ] 05/12 VUs  0m30.0s/1m45.0s

running (0m31.0s), 05/12 VUs, 262 complete and 0 interrupted iterations
default   [  30% ] 05/12 VUs  0m31.0s/1m45.0s

running (0m32.0s), 05/12 VUs, 267 complete and 0 interrupted iterations
default   [  30% ] 05/12 VUs  0m32.0s/1m45.0s

running (0m33.0s), 05/12 VUs, 277 complete and 0 interrupted iterations
default   [  31% ] 05/12 VUs  0m33.0s/1m45.0s

running (0m34.0s), 06/12 VUs, 287 complete and 0 interrupted iterations
default   [  32% ] 06/12 VUs  0m34.0s/1m45.0s

running (0m35.0s), 06/12 VUs, 297 complete and 0 interrupted iterations
default   [  33% ] 06/12 VUs  0m35.0s/1m45.0s

running (0m36.0s), 06/12 VUs, 306 complete and 0 interrupted iterations
default   [  34% ] 06/12 VUs  0m36.0s/1m45.0s

running (0m37.0s), 06/12 VUs, 318 complete and 0 interrupted iterations
default   [  35% ] 06/12 VUs  0m37.0s/1m45.0s

running (0m38.0s), 06/12 VUs, 327 complete and 0 interrupted iterations
default   [  36% ] 06/12 VUs  0m38.0s/1m45.0s

running (0m39.0s), 06/12 VUs, 336 complete and 0 interrupted iterations
default   [  37% ] 06/12 VUs  0m39.0s/1m45.0s

running (0m40.0s), 06/12 VUs, 348 complete and 0 interrupted iterations
default   [  38% ] 06/12 VUs  0m40.0s/1m45.0s

running (0m41.0s), 06/12 VUs, 358 complete and 0 interrupted iterations
default   [  39% ] 06/12 VUs  0m41.0s/1m45.0s

running (0m42.0s), 06/12 VUs, 367 complete and 0 interrupted iterations
default   [  40% ] 06/12 VUs  0m42.0s/1m45.0s

running (0m43.0s), 06/12 VUs, 377 complete and 0 interrupted iterations
default   [  41% ] 06/12 VUs  0m43.0s/1m45.0s

running (0m44.0s), 07/12 VUs, 387 complete and 0 interrupted iterations
default   [  42% ] 07/12 VUs  0m44.0s/1m45.0s

running (0m45.0s), 07/12 VUs, 397 complete and 0 interrupted iterations
default   [  43% ] 07/12 VUs  0m45.0s/1m45.0s

running (0m46.0s), 07/12 VUs, 407 complete and 0 interrupted iterations
default   [  44% ] 07/12 VUs  0m46.0s/1m45.0s

running (0m47.0s), 07/12 VUs, 417 complete and 0 interrupted iterations
default   [  45% ] 07/12 VUs  0m47.0s/1m45.0s

running (0m48.0s), 07/12 VUs, 427 complete and 0 interrupted iterations
default   [  46% ] 07/12 VUs  0m48.0s/1m45.0s

running (0m49.0s), 07/12 VUs, 437 complete and 0 interrupted iterations
default   [  47% ] 07/12 VUs  0m49.0s/1m45.0s

running (0m50.0s), 07/12 VUs, 447 complete and 0 interrupted iterations
default   [  48% ] 07/12 VUs  0m50.0s/1m45.0s

running (0m51.0s), 07/12 VUs, 457 complete and 0 interrupted iterations
default   [  49% ] 07/12 VUs  0m51.0s/1m45.0s

running (0m52.0s), 07/12 VUs, 467 complete and 0 interrupted iterations
default   [  50% ] 07/12 VUs  0m52.0s/1m45.0s

running (0m53.0s), 08/12 VUs, 474 complete and 0 interrupted iterations
default   [  50% ] 08/12 VUs  0m53.0s/1m45.0s

running (0m54.0s), 08/12 VUs, 484 complete and 0 interrupted iterations
default   [  51% ] 08/12 VUs  0m54.0s/1m45.0s

running (0m55.0s), 08/12 VUs, 494 complete and 0 interrupted iterations
default   [  52% ] 08/12 VUs  0m55.0s/1m45.0s

running (0m56.0s), 08/12 VUs, 504 complete and 0 interrupted iterations
default   [  53% ] 08/12 VUs  0m56.0s/1m45.0s

running (0m57.0s), 08/12 VUs, 514 complete and 0 interrupted iterations
default   [  54% ] 08/12 VUs  0m57.0s/1m45.0s

running (0m58.0s), 08/12 VUs, 524 complete and 0 interrupted iterations
default   [  55% ] 08/12 VUs  0m58.0s/1m45.0s

running (0m59.0s), 08/12 VUs, 534 complete and 0 interrupted iterations
default   [  56% ] 08/12 VUs  0m59.0s/1m45.0s

running (1m00.0s), 08/12 VUs, 544 complete and 0 interrupted iterations
default   [  57% ] 08/12 VUs  1m00.0s/1m45.0s

running (1m01.0s), 08/12 VUs, 554 complete and 0 interrupted iterations
default   [  58% ] 08/12 VUs  1m01.0s/1m45.0s

running (1m02.0s), 09/12 VUs, 564 complete and 0 interrupted iterations
default   [  59% ] 09/12 VUs  1m02.0s/1m45.0s

running (1m03.0s), 09/12 VUs, 574 complete and 0 interrupted iterations
default   [  60% ] 09/12 VUs  1m03.0s/1m45.0s

running (1m04.0s), 09/12 VUs, 584 complete and 0 interrupted iterations
default   [  61% ] 09/12 VUs  1m04.0s/1m45.0s

running (1m05.0s), 09/12 VUs, 594 complete and 0 interrupted iterations
default   [  62% ] 09/12 VUs  1m05.0s/1m45.0s

running (1m06.0s), 09/12 VUs, 604 complete and 0 interrupted iterations
default   [  63% ] 09/12 VUs  1m06.0s/1m45.0s

running (1m07.0s), 09/12 VUs, 614 complete and 0 interrupted iterations
default   [  64% ] 09/12 VUs  1m07.0s/1m45.0s

running (1m08.0s), 09/12 VUs, 624 complete and 0 interrupted iterations
default   [  65% ] 09/12 VUs  1m08.0s/1m45.0s

running (1m09.0s), 09/12 VUs, 634 complete and 0 interrupted iterations
default   [  66% ] 09/12 VUs  1m09.0s/1m45.0s

running (1m10.0s), 09/12 VUs, 644 complete and 0 interrupted iterations
default   [  67% ] 09/12 VUs  1m10.0s/1m45.0s

running (1m11.0s), 09/12 VUs, 654 complete and 0 interrupted iterations
default   [  68% ] 09/12 VUs  1m11.0s/1m45.0s

running (1m12.0s), 10/12 VUs, 668 complete and 0 interrupted iterations
default   [  69% ] 10/12 VUs  1m12.0s/1m45.0s

running (1m13.0s), 10/12 VUs, 685 complete and 0 interrupted iterations
default   [  70% ] 10/12 VUs  1m13.0s/1m45.0s

running (1m14.0s), 10/12 VUs, 702 complete and 0 interrupted iterations
default   [  70% ] 10/12 VUs  1m14.0s/1m45.0s

running (1m15.0s), 10/12 VUs, 718 complete and 0 interrupted iterations
default   [  71% ] 10/12 VUs  1m15.0s/1m45.0s

running (1m16.0s), 10/12 VUs, 735 complete and 0 interrupted iterations
default   [  72% ] 10/12 VUs  1m16.0s/1m45.0s

running (1m17.0s), 10/12 VUs, 751 complete and 0 interrupted iterations
default   [  73% ] 10/12 VUs  1m17.0s/1m45.0s

running (1m18.0s), 10/12 VUs, 768 complete and 0 interrupted iterations
default   [  74% ] 10/12 VUs  1m18.0s/1m45.0s

running (1m19.0s), 10/12 VUs, 785 complete and 0 interrupted iterations
default   [  75% ] 10/12 VUs  1m19.0s/1m45.0s

running (1m20.0s), 10/12 VUs, 801 complete and 0 interrupted iterations
default   [  76% ] 10/12 VUs  1m20.0s/1m45.0s

running (1m21.0s), 11/12 VUs, 820 complete and 0 interrupted iterations
default   [  77% ] 11/12 VUs  1m21.0s/1m45.0s

running (1m22.0s), 11/12 VUs, 844 complete and 0 interrupted iterations
default   [  78% ] 11/12 VUs  1m22.0s/1m45.0s

running (1m23.0s), 11/12 VUs, 866 complete and 0 interrupted iterations
default   [  79% ] 11/12 VUs  1m23.0s/1m45.0s

running (1m24.0s), 11/12 VUs, 890 complete and 0 interrupted iterations
default   [  80% ] 11/12 VUs  1m24.0s/1m45.0s

running (1m25.0s), 11/12 VUs, 913 complete and 0 interrupted iterations
default   [  81% ] 11/12 VUs  1m25.0s/1m45.0s

running (1m26.0s), 11/12 VUs, 936 complete and 0 interrupted iterations
default   [  82% ] 11/12 VUs  1m26.0s/1m45.0s

running (1m27.0s), 11/12 VUs, 960 complete and 0 interrupted iterations
default   [  83% ] 11/12 VUs  1m27.0s/1m45.0s

running (1m28.0s), 11/12 VUs, 983 complete and 0 interrupted iterations
default   [  84% ] 11/12 VUs  1m28.0s/1m45.0s

running (1m29.0s), 11/12 VUs, 1006 complete and 0 interrupted iterations
default   [  85% ] 11/12 VUs  1m29.0s/1m45.0s

running (1m30.0s), 11/12 VUs, 1030 complete and 0 interrupted iterations
default   [  86% ] 11/12 VUs  1m30.0s/1m45.0s

running (1m31.0s), 12/12 VUs, 1056 complete and 0 interrupted iterations
default   [  87% ] 12/12 VUs  1m31.0s/1m45.0s

running (1m32.0s), 11/12 VUs, 1081 complete and 0 interrupted iterations
default   [  88% ] 11/12 VUs  1m32.0s/1m45.0s

running (1m33.0s), 10/12 VUs, 1101 complete and 0 interrupted iterations
default   [  89% ] 10/12 VUs  1m33.0s/1m45.0s

running (1m34.0s), 10/12 VUs, 1118 complete and 0 interrupted iterations
default   [  90% ] 10/12 VUs  1m34.0s/1m45.0s

running (1m35.0s), 09/12 VUs, 1130 complete and 0 interrupted iterations
default   [  90% ] 09/12 VUs  1m35.0s/1m45.0s

running (1m36.0s), 08/12 VUs, 1140 complete and 0 interrupted iterations
default   [  91% ] 08/12 VUs  1m36.0s/1m45.0s

running (1m37.0s), 08/12 VUs, 1150 complete and 0 interrupted iterations
default   [  92% ] 08/12 VUs  1m37.0s/1m45.0s

running (1m38.0s), 06/12 VUs, 1163 complete and 0 interrupted iterations
default   [  93% ] 06/12 VUs  1m38.0s/1m45.0s

running (1m39.0s), 06/12 VUs, 1172 complete and 0 interrupted iterations
default   [  94% ] 06/12 VUs  1m39.0s/1m45.0s

running (1m40.0s), 05/12 VUs, 1183 complete and 0 interrupted iterations
default   [  95% ] 05/12 VUs  1m40.0s/1m45.0s

running (1m41.0s), 04/12 VUs, 1194 complete and 0 interrupted iterations
default   [  96% ] 04/12 VUs  1m41.0s/1m45.0s

running (1m42.0s), 03/12 VUs, 1204 complete and 0 interrupted iterations
default   [  97% ] 03/12 VUs  1m42.0s/1m45.0s

running (1m43.0s), 02/12 VUs, 1213 complete and 0 interrupted iterations
default   [  98% ] 02/12 VUs  1m43.0s/1m45.0s

running (1m44.0s), 01/12 VUs, 1222 complete and 0 interrupted iterations
default   [  99% ] 01/12 VUs  1m44.0s/1m45.0s

running (1m45.0s), 01/12 VUs, 1228 complete and 0 interrupted iterations
default   [ 100% ] 01/12 VUs  1m45.0s/1m45.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=950.1ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2458    23.405771/s
    checks_succeeded...: 100.00% 2458 out of 2458
    checks_failed......: 0.00%   0 out of 2458

    ✓ product burn endpoint returns 200
    ✓ product response remains valid

    HTTP
    http_req_duration..............: avg=514.08ms min=81.43ms med=517.37ms max=1.04s p(90)=949.49ms p(95)=950.1ms
      { expected_response:true }...: avg=514.08ms min=81.43ms med=517.37ms max=1.04s p(90)=949.49ms p(95)=950.1ms
    http_req_failed................: 0.00%  0 out of 1229
    http_reqs......................: 1229   11.702885/s

    EXECUTION
    iteration_duration.............: avg=564.61ms min=131.6ms med=567.9ms  max=1.09s p(90)=999.83ms p(95)=1s     
    iterations.....................: 1229   11.702885/s
    vus............................: 1      min=1         max=12
    vus_max........................: 12     min=12        max=12

    NETWORK
    data_received..................: 1.6 MB 15 kB/s
    data_sent......................: 114 kB 1.1 kB/s



running (1m45.0s), 00/12 VUs, 1229 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/12 VUs  1m45s